app/controllers/links_controller.rb

INSERT INTO "links" ("user_id", "url", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["url", "www.yahoo.co.jp"], ["created_at", 2016-10-02 23:15:06 UTC], ["updated_at", 2016-10-02 23:15:06 UTC], ["title", "Japan news 3"]]
---
  def create
    @link = Link.new(link_params)
    @link.user = current_user
      if @link.save