app/controllers/pages_controller.rb

  def index
    @links = Link.all
    @links = Link.paginate(:page => params[:page], :per_page => 5)
---
SELECT "links".* FROM "links"
SELECT  "links".* FROM "links" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "links"